## Staging: newrelic
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
```terraform
Plan: 5 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| update | `newrelic_workflow.terraform_notify_workflow`                     |
| add    | `newrelic_nrql_alert_condition.admin_error_percentage`            |
|        | `newrelic_nrql_alert_condition.admin_response_time`               |
|        | `newrelic_nrql_alert_condition.k8s_api_error_percentage`          |
|        | `newrelic_nrql_alert_condition.k8s_api_response_time`             |
|        | `newrelic_nrql_alert_condition.k8s_api_transaction_database_time` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # newrelic_nrql_alert_condition.admin_error_percentage will be created
  + resource "newrelic_nrql_alert_condition" "admin_error_percentage" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[Admin] Error percentage"
      + policy_id                    = 5457585
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 1
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (MjY5MTk3NHxBUE18QVBQTElDQVRJT058NTExMzk5NTgw) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
        }

      + warning {
          + operator              = "above"
          + threshold             = 0.5
          + threshold_duration    = 600
          + threshold_occurrences = "all"
        }
    }

  # newrelic_nrql_alert_condition.admin_response_time will be created
  + resource "newrelic_nrql_alert_condition" "admin_response_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[Admin] Response time"
      + policy_id                    = 5457585
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 0.5
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (MjY5MTk3NHxBUE18QVBQTElDQVRJT058NTExMzk5NTgw) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
        }

      + warning {
          + operator              = "above"
          + threshold             = 0.2
          + threshold_duration    = 600
          + threshold_occurrences = "all"
        }
    }

  # newrelic_nrql_alert_condition.k8s_api_error_percentage will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_error_percentage" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Error percentage"
      + policy_id                    = 5457585
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 2
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT ((filter(count(newrelic.timeslice.value), where metricTimesliceName = 'Errors/all') / filter(count(newrelic.timeslice.value), WHERE metricTimesliceName IN ('HttpDispatcher', 'OtherTransaction/all'))) OR 0) * 100 FROM Metric WHERE appId IN (MjY5MTk3NHxBUE18QVBQTElDQVRJT058NTExMzk5NjEx) AND metricTimesliceName IN ('Errors/all', 'HttpDispatcher', 'OtherTransaction/all', 'Agent/MetricsReported/count') FACET appId"
        }

      + warning {
          + operator              = "above"
          + threshold             = 1
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }
    }

  # newrelic_nrql_alert_condition.k8s_api_response_time will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_response_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Response time"
      + policy_id                    = 5457585
      + type                         = "static"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 0.1
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'HttpDispatcher') OR 0 FROM Metric WHERE appId IN (MjY5MTk3NHxBUE18QVBQTElDQVRJT058NTExMzk5NjEx) AND metricTimesliceName IN ('HttpDispatcher', 'Agent/MetricsReported/count') FACET appId"
        }

      + warning {
          + operator              = "above"
          + threshold             = 0.05
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }
    }

  # newrelic_nrql_alert_condition.k8s_api_transaction_database_time will be created
  + resource "newrelic_nrql_alert_condition" "k8s_api_transaction_database_time" {
      + account_id                   = (sensitive value)
      + aggregation_delay            = "120"
      + aggregation_method           = "event_flow"
      + aggregation_window           = 60
      + baseline_direction           = "lower_only"
      + enabled                      = true
      + entity_guid                  = (known after apply)
      + fill_option                  = "static"
      + fill_value                   = 0
      + id                           = (known after apply)
      + name                         = "[k8s API] Transaction database time"
      + policy_id                    = 5457585
      + type                         = "baseline"
      + violation_time_limit         = (known after apply)
      + violation_time_limit_seconds = 259200

      + critical {
          + operator              = "above"
          + threshold             = 2.81838
          + threshold_duration    = 300
          + threshold_occurrences = "all"
        }

      + nrql {
          + data_account_id = (known after apply)
          + query           = "SELECT filter(average(newrelic.timeslice.value), WHERE metricTimesliceName = 'Datastore/all') OR 0 FROM Metric WHERE appId IN (MjY5MTk3NHxBUE18QVBQTElDQVRJT058NTExMzk5NjEx) AND metricTimesliceName IN ('Datastore/all', 'Agent/MetricsReported/count') FACET appId"
        }

      + warning {
          + operator              = "above"
          + threshold             = 2.81838
          + threshold_duration    = 180
          + threshold_occurrences = "all"
        }
    }

  # newrelic_workflow.terraform_notify_workflow will be updated in-place
  ~ resource "newrelic_workflow" "terraform_notify_workflow" {
        id                    = "29b5ae0e-6918-4d87-84c6-71ce34368fad"
        name                  = "Notify Workflow - staging"
        # (7 unchanged attributes hidden)

      - destination {
          - channel_id              = "3a5ec568-369c-481c-bd49-598f5d394008" -> null
          - name                    = "Terraform Notify Slack Channel - staging" -> null
          - notification_triggers   = [
              - "ACKNOWLEDGED",
              - "ACTIVATED",
              - "CLOSED",
            ] -> null
          - type                    = "SLACK_LEGACY" -> null
          - update_original_message = true -> null
        }
      + destination {
          + channel_id              = "3a5ec568-369c-481c-bd49-598f5d394008"
          + name                    = (known after apply)
          + notification_triggers   = (known after apply)
          + type                    = (known after apply)
          + update_original_message = true
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

